[{"authors":[],"categories":[],"content":"Welcome to my personal blog! This site is a collection of my thoughts, projects, and learnings in the world of software development and technology.\n","date":"September 6, 2022","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/docs/introduction/","series":[{"title":"Guide","url":"/series/guide/"}],"smallImg":"","tags":[],"timestamp":1662475343,"title":"Introduction"},{"authors":[{"title":"Nitinprajwal","url":"/authors/nitinprajwal/"}],"categories":[{"title":"Image","url":"/categories/image/"}],"content":"Since v1.0.0-alpha.1, this theme supports much more image processing methods. Such as Crop, Fit and Fill images. You can also apply filters on an image.\n","date":"July 8, 2022","img":"/news/2022/07/more-image-processing-methods/featured-sample.webp","lang":"en","langName":"English","largeImg":"/news/2022/07/more-image-processing-methods/featured-sample_hu_ffe4dad5c4befef8.webp","permalink":"/news/2022/07/more-image-processing-methods/","series":[{"title":"News","url":"/series/news/"}],"smallImg":"/news/2022/07/more-image-processing-methods/featured-sample_hu_9945b80ff0392986.webp","tags":[{"title":"Crop","url":"/tags/crop/"},{"title":"Fit","url":"/tags/fit/"},{"title":"Fill","url":"/tags/fill/"},{"title":"Filters","url":"/tags/filters/"}],"timestamp":1657251287,"title":"More Image Processing Methods"},{"authors":[{"title":"Nitinprajwal","url":"/zh-hans/authors/nitinprajwal/"}],"categories":[{"title":"Image","url":"/zh-hans/categories/image/"}],"content":"Since v1.0.0-alpha.1, this theme supports much more image processing methods. Such as Crop, Fit and Fill images. You can also apply filters on an image.\nSee also Image Processing.\n","date":"July 8, 2022","img":"/news/2022/07/more-image-processing-methods/featured-sample.webp","lang":"zh-hans","langName":"简体中文","largeImg":"/news/2022/07/more-image-processing-methods/featured-sample_hu_ffe4dad5c4befef8.webp","permalink":"/zh-hans/news/2022/07/more-image-processing-methods/","series":[{"title":"News","url":"/zh-hans/series/news/"}],"smallImg":"/news/2022/07/more-image-processing-methods/featured-sample_hu_9945b80ff0392986.webp","tags":[{"title":"Crop","url":"/zh-hans/tags/crop/"},{"title":"Fit","url":"/zh-hans/tags/fit/"},{"title":"Fill","url":"/zh-hans/tags/fill/"},{"title":"Filters","url":"/zh-hans/tags/filters/"}],"timestamp":1657251287,"title":"More Image Processing Methods"},{"authors":[],"categories":[],"content":"Readme file\n","date":"April 17, 2022","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/blog/2022/04/readme/","series":[],"smallImg":"","tags":[{"title":"README","url":"/tags/readme/"}],"timestamp":1650184529,"title":"README"},{"authors":[],"categories":[],"content":"See also README.md.\n","date":"April 17, 2022","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/zh-hans/blog/2022/04/readme/","series":[],"smallImg":"","tags":[{"title":"README","url":"/zh-hans/tags/readme/"}],"timestamp":1650184529,"title":"README"},{"authors":[],"categories":[],"content":"Hi there, I\u0026rsquo;m XXX.\n","date":"February 28, 2019","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/zh-hans/about/","series":[],"smallImg":"","tags":[],"timestamp":1551312000,"title":"关于我"},{"authors":[],"categories":[],"content":"BTC$111,769.33+1.76%ETH$2,675.56+3.75%USDT$1.0001-0.03%XRP$2.4387+0.96%BNB$684.94+3.15%SOL$180.33+3.78%USDC$0.9997-0.00%DOGE$0.2426+3.84%ADA$0.8081+4.95%TRX$0.2777+2.13%SUI$3.9277-0.78%LINK$16.90+4.47%AVAX$25.36+8.21%HYPE$32.47+13.44%XLM$0.3024+3.02%SHIB$0.0₄1542+3.56%HBAR$0.2053+2.25%BCH$436.70+5.75%LEO$8.8619+0.99%TON$3.1818+2.64%\nNews\nBack to menu\nNews Markets Finance Tech Policy Focus Prices\nBack to menu\nPrices Data\nBack to menu\nData Trade Data Derivatives Order Book Data On-Chain Data API Research \u0026amp; Insights Data Catalogue AI \u0026amp; Machine Learning Indices\nBack to menu\nIndices Multi-Asset Indices Reference Rates Strategies and Services API Insights \u0026amp; Announcements Documentation \u0026amp; Governance Research\nBack to menu\nResearch Events\nBack to menu\nEvents Consensus 2025 Consensus 2025 Coverage Sponsored\nBack to menu\nSponsored Thought Leadership Press Releases CoinW MEXC Phemex Advertise Videos\nBack to menu\nVideos CoinDesk Daily Shorts Editor\u0026rsquo;s Picks Podcasts\nBack to menu\nPodcasts CoinDesk Podcast Network Markets Daily Gen C Unchained with Laura Shin The Mining Pod Newsletters\nBack to menu\nNewsletters The Node Crypto Daybook Americas State of Crypto Crypto Long \u0026amp; Short Crypto for Advisors Webinars \u0026amp; Events\nBack to menu\nWebinars \u0026amp; Events Consensus 2025 Policy \u0026amp; Regulation Conference English\nSelect Language\nEnglish enPortuguês pt-brУкраїнська ukEspañol esFilipino filFrançais frItaliano itРусский ru\nNews Prices Data Indices Research Events Sponsored Sign In Sign Up CoinDesk Indices\nShare\nShare this article\nCopy linkX iconX (Twitter)LinkedInFacebookEmail\nCrypto for Advisors: When Crypto Meets Netflix How Black Mirror’s on-chain experiment is paving the way for the future of entertainment monetization. By Shivani Phull|Edited by Sarah Morton\nMay 22, 2025, 3:00 p.m.\n(Robby McCullough/ Unsplash)\nWhat to know: You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.\nLast week was Consensus Toronto 2025. If you couldn’t attend, CoinDesk has you covered! Listen to amazing global thought leaders, sharing their insights on pertinent topics surrounding the digital asset space on day 1, day 2 and day 3. You can also read the extensive editorial coverage.\nIn today’s Crypto for Advisors, Shivani Phull from Pixelynx explains how Black Mirror is leveraging blockchain as part of evolving fan content and engagement.\nSTORY CONTINUES BELOW\nDon\u0026rsquo;t miss another story.Subscribe to the Crypto Long \u0026amp; Short Newsletter today. See all newsletters\nSign me up\nBy signing up, you will receive emails about CoinDesk products and you agree to our terms of use and privacy policy.\nThen, Eric Tomaszewski from Verde Capital Management answers questions about the appeal of these products to next-gen investors in Ask an Expert.\nThank you to our sponsor of this week\u0026rsquo;s newsletter, Grayscale. For financial advisors near Boston, Grayscale is hosting an exclusive event, Crypto Connect, on Thursday, June 5. Learn more.\n– Sarah Morton\nStorytelling 3.0: When AI, Blockchain and IP Collide How Black Mirror’s on-chain experiment is paving the way for the future of entertainment monetization.\nTraditional storytelling is hitting its ceiling. The passive, one-way consumption model that has defined entertainment for decades is increasingly out of sync with the expectations of digital-native audiences. And now, with the rise of new technologies, the entertainment intellectual property (IP) is entertainment intellectual property, or IP, is being fundamentally reimagined.\nFrom Bandersnatch to Blockchain Black Mirror has never been afraid to challenge the status quo. In 2018, the series broke new ground with Bandersnatch, an interactive episode. It hinted at a deeper shift: from stories we watch to stories we shape.\nThat shift is accelerating. Members of Gen Z and Gen Alpha have been raised in worlds like Minecraft, Roblox and Fortnite, where user-generated content forms the foundation of the experience. These audiences don’t want to passively consume; they want to participate, shape and own the narrative.\nTraditional IP Revenue Is Evolving Traditionally, IP holders made money through licensing, syndication, product placement and box office sales. But generative AI is disrupting this model. With tools like OpenAI’s Sora or Runway, anyone can spin up derivative content, posing both a threat and an opportunity. For IP owners, the challenge is clear: either lose control of the narrative or lean into new models that protect and expand it.\nEnter blockchain.\nBlockchain as the Rails for Interactive IP Blockchain brings the missing layer of structure. It allows for:\nOn-chain IP verification — using blockchain to prove who owns creative content, making it secure and transparent. Composable rights — content can be broken down into smaller parts that others can build on, remix or combine with new creations, allowing for microlicensing. Community ownership and participation rewards — fans can hold tokens that give them access to exclusive experiences and benefits as the project grows. Tokenized incentives for creators and fans — digital tokens are used to reward people for contributing, collaborating or being active in the community. This format unlocks new paths for storytelling, where fans are stakeholders shaping narratives with their favorite IPs, not just spectators.\nCase Study: Black Mirror Enters Web3 Banijay Rights, the global sales arm of content powerhouse Banijay Entertainment, which handles distribution for Black Mirror, has partnered with Pixelynx Inc. and KOR Protocol, a blockchain-based IP infrastructure and entertainment company based in Los Angeles, co-founded by iconic DJs Deadmau5 and Richie Hawtin. Led by visionary CEO Inder Phull, Pixelynx helped bring the Black Mirror universe on-chain in a way that’s interactive, compliant and community-driven.\nTheir latest initiative is a token inspired by the Nosedive episode, where fans link their socials and wallets to earn a reputation score. With more than 300,000 sign-ups, top participants unlock exclusive experiences and rewards, offering IP holders a new way to engage and reward their most passionate fans.\nThe IP Industry’s Fork in the Road The future of entertainment lies in embracing this shift through new frameworks that provide clear guardrails for IP usage, that preserve integrity, protect rights and enable value to accrue to fans and creators in a fair and transparent way. This marks the beginning of a new era for IP: one defined by protection, participation and sustainable monetization.\nBy making IPs interactive, tokenized and on-chain, rights holders aren’t just experimenting—they’re sketching the blueprint for Storytelling 3.0.\n- Shivani Phull, CFO, Pixelynx Inc.\nAsk an Expert Q. What does \u0026ldquo;ownership\u0026rdquo; mean in the age of Web3, and how is it different from traditional investing?\nA. Ownership in Web3 is not just about holding an asset. More so, it\u0026rsquo;s about participating in a system. With the Black Mirror token, owning the token means having a say in governance, gaining access to exclusive ecosystems, and building a digital form of identity that has the ability to grow in value over time. Unlike passive stock ownership, this is participatory. You are a stakeholder, not just a shareholder.\nQ. Can reputation-based tokens create economic value from behavior and is it sustainable?\nA. Yes, but it\u0026rsquo;s nuanced. Black Mirror token gamifies trust because your on-chain actions and social interactions can earn tangible rewards. As a financial advisor, I\u0026rsquo;d caution that while this is exciting, it introduces performance-based risk. That being said, it reflects the direction of where young digitally native investors are heading.\nQ. Could these tokens act as a new form of \u0026ldquo;digital yield\u0026rdquo; for younger investors?\nA. Absolutely. Instead of fixed income yield, this is engagement yield. The more active and credible you are, the more awards you could potentially earn. It could be whitelisting access, platform discounts, or possibly token-based income. This is a new incentive model in some respects.\nWhen speaking to a client, I frame it as a form of behavioral finance in motion. With the right level of risk and time allocation, it becomes an asset that pays in influence and access. It\u0026rsquo;s also a way to acknowledge that fulfillment and value look different to each person. Not every return is financial.\n- Eric Tomaszewski, financial advisor, Verde Capital Management\nKeep Reading JP Morgan to enable clients to invest in bitcoin. Robinhood to acquire Canadian crypto firm Wonderfi. The U.S. Senate voted 66-32 to advance its landmark stablecoin legislation, the GENIUS Act. Digital Assets: Month in Review, with Joshua de Vos of CoinDesk delivering a monthly column on the crypto markets and ETF/ETP flows. Web3Black MirrorGen ZGeneration ZCrypto for AdvisorsCoinDesk Indices\nShivani Phull Strategic finance and operations leader with experience across the U.S., UK, and UAE, focused on venture capital, M\u0026amp;A, and scaling high-growth companies. Shivani has worked across AI/web3 (Pixelynx/Animoca), music IP (The Circuit Group), and FMCG (Reckitt Benckiser). Deep expertise in FP\u0026amp;A, M\u0026amp;A, token launches, and financial reporting. Highlights include raising $45 million+, leading Pixelynx’s Series A acquisition, and building finance ops for startups, funds, DAOs, and corporates.\nAbout\nAbout Us Masthead Careers CoinDesk News Crypto API Documentation Contact\nContact Us Accessibility Advertise Sitemap System Status DISCLOSURE \u0026amp; POLICES\nCoinDesk is an award-winning media outlet that covers the cryptocurrency industry. Its journalists abide by a strict set of editorial policies. CoinDesk has adopted a set of principles aimed at ensuring the integrity, editorial independence and freedom from bias of its publications. CoinDesk is part of the Bullish group, which owns and invests in digital asset businesses and digital assets. CoinDesk employees, including journalists, may receive Bullish group equity-based compensation. Bullish was incubated by technology investor Block.one.\nEthicsPrivacyTerms of UseCookie SettingsDo Not Sell My Info\n© 2025 CoinDesk, Inc.\nX icon\n","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/blog/1/01/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":""},{"authors":[],"categories":[],"content":"Hi there, I\u0026rsquo;m Nitin Prajwal. I\u0026rsquo;m a software engineer with a strong background in building and deploying web applications. I\u0026rsquo;m experienced in various technologies including Python, JavaScript, AWS, and Docker. I enjoy tackling complex problems and continuously learning new skills.\nThis blog is a space where I share my thoughts, projects, and learnings related to software development, technology trends, and more.\n","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/about/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"About Nitin Prajwal"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/contact/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Contact Us"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/offline/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Offline"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/zh-hans/offline/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Offline"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"zh-hans","langName":"简体中文","largeImg":"","permalink":"/zh-hans/contact/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"联系我们"}]
